// Чи стійка до взлому функція перевірки паролю? чи є спосіб підібрати пароль ?
// дано: є десктопна зкомпільована програма з обмеженням доступу по паролю до певних кнопок, програміст реалізував наступну функцію для перевірки доступу.
// хакер  не може подивитися на початковий код а лише викликати функцію з паролем

function hasAccess(password) {
  if (password == 'secure password') {
    return true;
  } else {
    return false;
  }
}

console.log(
  'Вважаю що дана функція, відносно до витраченого часу на підбір паролю, стійка до взлому, так як латинський алфавіт має 26 літер,\
тобто щоб підібрати 15ти значне слово потрібно превірити (27*27*27*27*27*27*27*27*27*27*27*27*27*27*27) 2,188379782630247e+20 варіантів (26літер + 1пробіл), \
що є дуже багато, і це навіть якщо припустити що хакер підбирає тільки латинські літери нижнього реєстру, що є малоймовірно'
);
