// Чи стійка до взлому функція перевірки паролю? чи є спосіб підібрати пароль ?
// дано: є десктопна зкомпільована програма з обмеженням доступу по паролю до певних кнопок, програміст реалізував наступну функцію для перевірки доступу.
// хакер  не може подивитися на початковий код а лише викликати функцію з паролем

function hasAccess(password) {
  if (password == 'secure password') {
    return true;
  } else {
    return false;
  }
}

console.log('Вважаю що дана функція  відносно стійка до взлому, так як ');
